app/controllers/configurations_controller.rb

  def index
    @configurations = Configuration.all
---
SELECT * FROM "configurations"

  def show
    @configuration = Configuration.find(params[:id])
---
SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)

  def edit
    @configuration = Configuration.find(params[:id])
---
SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)

  def update
    @configuration = Configuration.find(params[:id])
    if @configuration.update_attributes(params[:configuration])
---
SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)
UPDATE "configurations" SET "updated_at" = '2009-12-23 09:11:55', "value" = 'test@test.com' WHERE "id" = 1