app/controllers/contacts_controller.rb

  def new
    session[:time] = Time.now.to_i
    @email = Configuration.name_equals("email").first
---
SELECT * FROM "configurations" WHERE (configurations.name = 'email') LIMIT 1