app/controllers/images_controller.rb

SELECT * FROM "images" ORDER BY id DESC
---
  def index
    @images = Image.all :order => 'id DESC'

SELECT * FROM "images" WHERE ("images"."id" = 1)
---
  def show
    @image = Image.find(params[:id])

INSERT INTO "images" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('test', '2009-12-23 10:15:21', NULL, '2009-12-23 10:15:21', NULL, NULL, NULL)
---
  def create
    @image = Image.new(params[:image])
    if @image.save

SELECT * FROM "images" WHERE ("images"."id" = 1)
---
  def edit
    @image = Image.find(params[:id])