app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT * FROM "news" ORDER BY id DESC

  def show
    @news = News.find(params[:id])
---
SELECT * FROM "news" WHERE (news.id < 8) ORDER BY news.id DESC LIMIT 1

  def create
    @news = News.new(params[:news])
    if @news.save
---
INSERT INTO "news" ("created_at", "title", "updated_at", "content") VALUES('2009-12-23 10:27:16', 'lorem ipsum dkk deh', '2009-12-23 10:27:16', 'Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Donec odio. Quisque volutpat mattis eros. Nullam malesuada erat ut turpis. Suspendisse urna nibh, viverra non, semper suscipit, posuere a, pede.

  def edit
    @news = News.find(params[:id])
---
SELECT * FROM "news" WHERE ("news"."id" = 1)

  def update
    @news = News.find(params[:id])
    if @news.update_attributes(params[:news])
---
SELECT * FROM "news" WHERE ("news"."id" = 5)
UPDATE "news" SET "updated_at" = '2009-12-24 03:57:11', "title" = 'dfgdfgsds' WHERE "id" = 5

  def destroy
    @news = News.find(params[:id])
    @news.destroy
---
SELECT * FROM "news" WHERE (news.id > 3) LIMIT 1
DELETE FROM "news" WHERE "id" = 2