app/controllers/services_controller.rb

SELECT * FROM "services" ORDER BY id DESC
---
  def index
    @services = Service.all :order => 'id DESC'

SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def show
    @service = Service.find(params[:id])

INSERT INTO "services" ("name", "created_at", "updated_at", "description") VALUES('Garden Making', '2009-12-23 10:12:59', '2009-12-23 10:12:59', '')
---
  def create
    @service = Service.new(params[:service])
    if @service.save